InformationRegisters/СтатусыОбменаДокументовБИА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОбменаДокументовБИА</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументБИА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыБИА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПакетДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыДокументовДля1САрхива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыОбменаДокументовБИА/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает статус обмена для объекта.
//
// Параметры:
//  ОбъектСсылка - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА, СправочникСсылка.ДокументыБИА - объект.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыОбменаС1САрхивом - статус обмена.
// 
Функция СтатусДокумента(ОбъектСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ДокументыБИА") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СтатусыОбменаДокументовБИА.Статус, &СтатусНеГотов) КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыОбменаДокументовБИА КАК СтатусыОбменаДокументовБИА
			|ГДЕ
			|	СтатусыОбменаДокументовБИА.ДокументБИА = &ОбъектСсылка";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕСТЬNULL(СтатусыОбменаДокументовБИА.Статус, &СтатусНеГотов) КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыОбменаДокументовБИА КАК СтатусыОбменаДокументовБИА
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА КАК ДокументыБИА
			|		ПО СтатусыОбменаДокументовБИА.ДокументБИА = ДокументыБИА.Ссылка
			|ГДЕ
			|	ДокументыБИА.ОбъектОснование = &ОбъектСсылка";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("СтатусНеГотов", );
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Статус;
	
КонецФункции


#КонецОбласти

#КонецЕсли
